do
 function run(msg, matches)
if is_momod(msg) then
return [[
💠 لیست راهنمای مگا تسلا! 💠
—------------------------—
🔹ابزارها: 
🔰فعال سازی ابزارها با دستور : فعال سازی ابزارها
🔰غیرفعال سازی ابزارها با دستور :غیرفعال سازی ابزارها
🚩راهنمای ابزارها: لیست ابزارها

🔸مدیریت سوپرگروه:
🚩راهنمای سوپرگروه : با زدن این دستور میتوانید از لیست دستورات مدیریتی سوپرگروه با مگاتسلا بهره مند شوید!

🔹 بات کمکی: 
> @MegaTeslaBot
شما با مراجعه به این بات میتوانید از دستورات،ابزارها مطلع شوید!

—----------------------------------------------------------------------------
کانال ما: 
> @MegaTesla_Ch
]]
end
end
return {
patterns = {
    "^([!/#]help)$",
    "^(help)$",
    "^(راهنما)$",
},
run = run
}
end