do
 function run(msg, matches)
if is_momod(msg) then
return [[
📥 دستورات مدیریت سوپرگروه با مگاتسلا
—------------------------—
1⃣ مدیریت سوپرگروه!
💠 قفل [لینک,اسپم,فلود,استیکر,مخاطب,همراه اول,فحش,فوروارد,اعضا,سیستم,اعلان ها]
🚩با این دستور میتوانید موارد فوق را قفل کنید !
💠 بازکردن [لینک,اسپم,فلود,استیکر,مخاطب,همراه اول,فحش,فوروارد,اعضا,سیستم,اعلان ها]
🚩 با این دستور قفل موارد فوق را باز کنید!
💠 تنظیمات
🚩 دریافت تنظیمات سوپرگروه (مدیران و بالاتر)
💠 ممنوعیت [گیف,صدا,عکس,فایل,فیلم,همه,متن]
🚩 ممنوع کردن فرستادن موارد بالا (اگر کسی یکی از موارد فوق را ارسال کند پیامش حذف خواهد شد!)
💠 -ممنوعیت [گیف,صدا,عکس,فایل,فیلم,همه,متن]
🚩 لغو ممنوعیت موارد فوق
2⃣ مقام ها!
📍 ارتقا (با ریپلی-یوزرنیم-آیدی)
🚩 ترفیع مقام شخص به مدیر
📍 عزل (با ریپلی-یوزرنیم-آیدی)
🚩 برکنار کردن فرد از مدیر بودن
📍 لیست مدیران
🚩 دریافت لیست مدیر های گروه
3⃣ اخراج اعضا!
💉 بلاک (ریپلی)
🚩 حذف دائمی فرد از گروه و وارد کردن او به بلاک لیست
💉 اخراج (ریپلی-آیدی-یوزرنیم)
🚩 حذف فرد از سوپرگروه
—------------------------—
🔹 بات کمکی: 
> @MegaTeslaBot
شما با مراجعه به این بات میتوانید از دستورات،ابزارها مطلع شوید!

—---------------------------------------------------------------
کانال ما: 
> @MegaTesla_Ch
]]
end
end
return {
patterns = {
    "^(راهنمای سوپرگروه)$",
},
run = run
}
end